server/artillery/load-test.yml
config:
  target: "http://localhost:3002"
  phases:
    # Warm-up phase
    - duration: 30
      arrivalRate: 5
      name: "Warm-up"
    
    # Ramp-up phase
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: "Ramp-up to 50 users/sec"
    
    # Sustained load phase
    - duration: 120
      arrivalRate: 50
      name: "Sustained load (50 users/sec)"
    
    # Spike test
    - duration: 30
      arrivalRate: 100
      name: "Spike test (100 users/sec)"
    
    # Cool down
    - duration: 30
      arrivalRate: 10
      name: "Cool down"
  
  processor: "./processor.js"
  
  # Performance thresholds
  ensure:
    maxErrorRate: 1  # Max 1% error rate
    p95: 500         # 95th percentile response time < 500ms
    p99: 1000        # 99th percentile response time < 1000ms

  # Plugins for reporting
  plugins:
    expect: {}
    metrics-by-endpoint: {}

scenarios:
  # Test 1: Health check (baseline)
  - name: "Health Check"
    weight: 10
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: status

  # Test 2: Cache stats (monitoring endpoint)
  - name: "Cache Stats"
    weight: 5
    flow:
      - get:
          url: "/api/cache/stats"
          expect:
            - statusCode: 200
            - contentType: json

  # Test 3: Organization list (super admin)
  - name: "Get All Organizations"
    weight: 20
    flow:
      - post:
          url: "/api/multi-tenant/organizations"
          beforeRequest: "setAuthToken"
          expect:
            - statusCode: [200, 401]  # 401 expected if not authenticated

  # Test 4: Organization metrics with caching
  - name: "Get Organization Overview"
    weight: 30
    flow:
      - get:
          url: "/api/multi-tenant/overview"
          qs:
            from: "2024-01-01T00:00:00.000Z"
            to: "2024-12-31T23:59:59.999Z"
          beforeRequest: "setAuthToken"
          expect:
            - statusCode: [200, 401]

  # Test 5: Paginated calls (cursor-based)
  - name: "Get Organization Calls (Paginated)"
    weight: 25
    flow:
      - get:
          url: "/api/multi-tenant/calls"
          qs:
            limit: 50
            from: "2024-01-01T00:00:00.000Z"
            to: "2024-12-31T23:59:59.999Z"
          beforeRequest: "setAuthToken"
          expect:
            - statusCode: [200, 401]
            - contentType: json

  # Test 6: Rate limit testing
  - name: "Rapid Requests (Rate Limit Test)"
    weight: 10
    flow:
      - loop:
          - get:
              url: "/health"
          count: 100