server/artillery/stress-test.yml
config:
  target: "http://localhost:3002"
  phases:
    # Gradually increase to stress point
    - duration: 60
      arrivalRate: 1
      rampTo: 200
      name: "Ramp to stress point"
    
    # Maximum stress
    - duration: 120
      arrivalRate: 200
      name: "Maximum stress (200 users/sec)"
    
    # Beyond breaking point
    - duration: 60
      arrivalRate: 500
      name: "Breaking point test"
  
  processor: "./processor.js"
  
  # Relaxed thresholds for stress testing
  ensure:
    maxErrorRate: 10  # Allow 10% errors during stress test
    p95: 2000         # 95th percentile < 2s
    p99: 5000         # 99th percentile < 5s

scenarios:
  # Focus on most common endpoints
  - name: "Health Check (Stress)"
    weight: 30
    flow:
      - get:
          url: "/health"

  - name: "Cache Stats (Stress)"
    weight: 20
    flow:
      - get:
          url: "/api/cache/stats"

  - name: "API Calls (Stress)"
    weight: 50
    flow:
      - get:
          url: "/api/multi-tenant/overview"
          qs:
            from: "2024-01-01T00:00:00.000Z"
            to: "2024-12-31T23:59:59.999Z"
          beforeRequest: "setAuthToken"